

cisco3#terminal width 511
cisco3#terminal length 0
cisco3#
cisco3#show ip int brief | redirect flash:/jall_show_ip_int_brief.txt
%Warning: There is a file already existing with this name
Do you want to over write? [confirm]

cisco3#
cisco3#more jall_show_ip_int_brief.txt
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   10.220.88.22    YES NVRAM  up                    up      
GigabitEthernet0/0/1   unassigned      YES unset  administratively down down    
GigabitEthernet0/1/0   unassigned      YES unset  down                  down    
GigabitEthernet0/1/1   unassigned      YES unset  down                  down    
GigabitEthernet0/1/2   unassigned      YES unset  down                  down    
GigabitEthernet0/1/3   unassigned      YES unset  down                  down    
Virtual-Access1        unassigned      YES unset  down                  down    
Vlan1                  unassigned      YES unset  up                    down    


cisco3#
cisco3#verify /md5 flash:/jall_show_ip_int_brief.txt
.Done!
verify /md5 (bootflash:/jall_show_ip_int_brief.txt) = e0cb74141fa752dc1b88ad55ce334803


cisco3#
cisco3#dir flash:/jall_show_ip_int_brief.txt
Directory of bootflash:/jall_show_ip_int_brief.txt

   96  -rw-              730   Apr 4 2021 04:47:55 -07:00  jall_show_ip_int_brief.txt

2908606464 bytes total (1783791616 bytes free)
cisco3#
cisco3#exit
